---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.#ctor
source: html/10ea785f-0781-57cd-9392-d0c34a38d853.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.#ctor Method

Initializes a new instance of the MEPBuildingConstructionSet class

## Syntax (C#)
```csharp
public MEPBuildingConstructionSet()
```